


const Console = () => {
  console.log('%c' +
    'вёрстка валидная +10\n' +
    '\n' +
    'Для проверки валидности вёрстки используйте сервис https://validator.w3.org/\n' +
    'Надпись "Document checking completed. No errors or warnings to show." +10\n' +
    '\n' +
    'вёрстка семантическая +20\n' +
    '\n' +
    'В коде страницы присутствуют семантические теги HTML5, например, article, aside, figure, figcaption, footer, ' +
    'header, main, nav, section, используются заголовки h1-h6. Заголовок h1 может быть только один.\n' +
    '2 балла за каждый уникальный семантический тег HTML5 и за каждый уникальный заголовок h1-h6, но не больше 20 баллов +20\n' +
    '\n' +
    'для оформления СV используются css-стили +10\n' +
    '\n' +
    '1 балл за каждый стилизованный элемент, но не больше 10 баллов +10\n' +
    '\n' +
    'контент размещается в блоке, который горизонтально центрируется на странице. Фоновый цвет, если он есть, тянется во всю ширину страницы +10\n' +
    '\n' +
    'вёрстка адаптивная: ни на одном из разрешений экрана до 320px включительно не появляется горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется +10\n' +
    '\n' +
    'есть адаптивное бургер-меню. Ссылки в пунктах меню ведут на основные разделы CV. При кликах по пунктам меню реализована плавная прокрутка по якорям. При уменьшении ширины экрана меню становится адаптивным. Внешний вид адаптивного меню можно скопировать с макета музея +10\n' +
    '\n' +
    'на странице СV присутствует изображение - фото или аватарка автора CV, пропорции изображения не искажены, у изображения есть атрибут alt (может быть пустым) +10\n' +
    '\n' +
    'контакты для связи и перечень навыков оформлены в виде списка ul > li +10\n' +
    '\n' +
    'CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского +10\n' +
    '\n' +
    'CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода. Для подсветки кода может использоваться js-библиотека, например, highlight.js +10\n' +
    '\n' +
    'CV содержит изображения-ссылки на выполненные вами проекты. При клике по изображению страница проекта открывается в новой вкладке. У каждого проекта есть название, небольшое описание, указан перечень используемых технологий. +10\n' +
    '\n' +
    'CV выполнено на английском языке +10\n' +
    '\n' +
    'выполнены требования к Pull Request: есть ссылка на задание, скриншот страницы СV, ссылка на деплой страницы CV на GitHub Pages, выполнена самооценка (самооценку расписываем по пунктам критериев оценки, указывая балл за каждый пункт) +10\n' +
    '\n' +
    'Вниманию проверяющих. Так как сабмитится ссылка на деплой CV, вам необходимо будет самостоятельно найти Pull Request для проверки. Для этого по ссылке в футере перейдите на гитхаб автора CV, найдите там репозиторий rsschool-cv, в нём открытый PR из ветки cv-html-css в ветку main с названием CV и проверьте его описание.\n' +
    '\n' +
    'есть видеорезюме автора CV на английском языке. Видеорезюме встраивается в страницу CV как видео, а не в виде кнопки или ссылки. Продолжительность видео 3-5 минут (±15 секунд). В описание видео на YouTube добавлена ссылка на его транскрипцию на английском языке (например, в документе Google Docs). +10\n' +
    '\n' +
    'дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию (это дополнительные 10 баллов, поэтому некоторый субъективизм в оценке может присутствовать) +10' +
    '\n' +
    '\n' +
    '\n' +
    'ИТОГО: 150 баллов' +
    '\n' +
    '\n' +
    '\n' +
    'Ссылка на ПР - https://github.com/AlekseyVY/rsschool-cv/pull/7',
    'background: #fff; color: #f74705')
}

export default Console;